42crunch.vscode-openapi
4ops.terraform
alefragnani.project-manager
bierner.markdown-mermaid
bradlc.vscode-tailwindcss
christian-kohler.path-intellisense
codezombiech.gitignore
dart-code.dart-code
dart-code.flutter
dbaeumer.vscode-eslint
donjayamanne.githistory
eamodio.gitlens
esbenp.prettier-vscode
firsttris.vscode-jest-runner
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
github.copilot
github.copilot-chat
github.vscode-pull-request-github
golang.go
hashicorp.terraform
janisdd.vscode-edit-csv
jock.svg
mhutchie.git-graph
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-ja
ms-vscode.makefile-tools
orta.vscode-jest
pkief.material-icon-theme
redhat.vscode-yaml
saoudrizwan.claude-dev
shd101wyy.markdown-preview-enhanced
steoates.autoimport
streetsidesoftware.code-spell-checker
wmaurer.change-case
zxh404.vscode-proto3
